# ============================================================================
# 付録E. 集熱器群の面積及び集熱後の空気を供給する床下の面積
# ============================================================================

# ============================================================================
# E.1 集熱器群の面積
# ============================================================================

def get_A_col_j(A_col_j_raw):
    """集熱器の面積

    Args:
      A_col_j_raw(float): 集熱器群jの面積

    Returns:
      float: 集熱器群jの面積の小数点第二位を四捨五入した値

    """
    return round(A_col_j_raw * 10) / 10

# E.2 集熱後の空気を供給する床下の面積
