# ============================================================================
# 付録D 集熱器の集熱効率特性線図一次近似式
# ============================================================================

# D.1 記号及び単位

# D.2 集熱器の集熱効率特性線図一次近似式

def get_etr(d_0, d_1, Theta_in, Theta_ex, I_s):
    """集熱器の集熱効率特性線図一次近似式(JIA A 4112 または SS-TS010) (1)

    Args:
      d_0(tuple): 集熱器の集熱効率特性線図一次近似式の切片
      d_1(tuple): 集熱器群を構成する集熱器の集熱効率特性線図一次近似式の傾き (W/(m2K))
      Theta_in(float): 集熱器の入口における空気温度
      Theta_ex(ndarray): 外気温度
      I_s(float): 単位面積当たりの平均日射量

    Returns:
      float: 集熱器の集熱効率特性線図一次近似式

    """
    return d_0 - d_1 * (Theta_in - Theta_ex) / I_s
