# ============================================================================
# 付録 C 増改築部分を対象として単位住戸のエネルギー消費性能を評価する場合に適用する
#        各設備の基準一次エネルギー消費量の算定に係る設定
# ============================================================================

import pyhees.section11_7 as sc11_7


# ============================================================================
# C.2.2 床面積の合計・主たる居室の床面積・その他の居室の床面積
# ============================================================================

def get_A(tatekata):
    """床面積の合計、主たる居室の床面積およびその他の居室の床面積 を取得する関数

    Args:
        tatekata (str): 建て方

    Returns:
        A_A (float): 床面積の合計 (m2)
        A_MR (float): 主たる居室の床面積 (m2)
        A_OR (float): その他の居室の床面積 (m2)
    """
    # 床面積の合計、主たる居室の床面積およびその他の居室の床面積は、十一章「その他」第七節「基準設定仕様」を適用する。
    A_A, A_MR, A_OR, _ = sc11_7.get_A(tatekata)

    return A_A, A_MR, A_OR
