# ============================================================================
# 付録 A 機器の性能を表す仕様の決定方法
# ============================================================================

# ============================================================================
# A.2 最大暖房能力
# ============================================================================

def get_q_max_H(A_HCZ):
    """最大暖房能力

    Args:
      A_HCZ(float): 暖冷房区画の床面積

    Returns:
      float: 最大暖房能力

    """
    return 240.1 * A_HCZ  # (1)


# ============================================================================
# A.3 連続運転時最小能力
# ============================================================================

def get_q_min_H(q_max_H):
    """連続運転時最小能力

    Args:
      q_max_H(float): 最大暖房能力

    Returns:
      float: 連続運転時最小能力

    """
    q_min_H = 0.4334 * q_max_H - 540.1  # (2)
    return max(0.0, q_min_H)


# ============================================================================
# A.4 定格燃料効率
# ============================================================================

def get_e_rtd_H_default():
    """定格燃料効率

    Args:

    Returns:
      float: 定格燃料効率

    """
    return 0.860


def get_e_rtd_H(e_rtd_H_raw):
    """

    Args:
      e_rtd_H_raw: 

    Returns:

    """
    return round(e_rtd_H_raw * 1000) / 1000


# ============================================================================
# A.5 定格暖房消費電力
# ============================================================================

def get_P_rtd_H(q_max_H):
    """定格暖房消費電力

    Args:
      q_max_H(float): 最大暖房能力

    Returns:
      float: 定格暖房消費電力

    """
    return 3.13 / 1000 * q_max_H  # (3)


# ============================================================================
# A.6 断続時消費電力
# ============================================================================

def get_P_itm_H():
    """断続時消費電力

    Args:

    Returns:
      float: 断続時消費電力

    """
    return 40.0


# ============================================================================
# A.7 複数の FF 暖房機が設置される場合の仕様の決定方法
# ============================================================================

def get_e_rtd_from_multi_devices(e_rtd_list):
    """複数の FF 暖房機が設置される場合の仕様の決定方法

    Args:
      e_rtd_list(list: list: list): 定格エネルギー消費効率の配列

    Returns:
      float: 複数の FF 暖房機が設置される場合の仕様の決定方法

    """
    return min(e_rtd_list)


if __name__ == '__main__':
    A_HCZ = 120.08

    # 最大暖房能力
    q_max_H = get_q_max_H(A_HCZ)

    # 最大冷房能力
    q_min_H = get_q_min_H(q_max_H)

    # 定格暖房消費電力
    P_rtd_H = get_P_rtd_H(q_max_H)

    # 断続時消費電力
    P_itm_H = get_P_itm_H()

    print('A_HCZ = {}'.format(A_HCZ))
    print('q_min_H = {}'.format(q_min_H))
    print('q_max_H = {}'.format(q_max_H))
    print('P_rtd_H = {}'.format(P_rtd_H))
    print('P_itm_H = {}'.format(P_itm_H))
