# ============================================================================
# 付録 B 特定建築主基準における設計一次エネルギー消費量の算定に係る設定
# ============================================================================


# ============================================================================
# B.3 暖房設備
# ============================================================================

def update_spec_for_ees(spec):
    """敷設率を上書きする関数

    参照：第二章第二節付録B B.3 暖房設備
    """
    if spec['type'] == '事業主基準':
        for _ in ['H_MR', 'H_OR']:
            H_xR = spec.get(_)

            if H_xR is not None:
                if H_xR['type'] in ['電気ヒーター床暖房', '温水暖房用床暖房', 'ルームエアコンディショナー付温水床暖房機', '温水床暖房（併用運転に対応）']:
                    H_xR['r_Af'] = 0.40
