# ============================================================================
# 付録 O 地中熱ヒートポンプ温水暖房機の熱交換器タイプの決定方法
# ============================================================================

# ============================================================================
# O.3 熱交換器タイプ 
# ============================================================================

def get_virtual_HeatExchangerType(HeatExchangerType):
    """ 実質的な熱交換器タイプの取得

    :param HeatExchangerType: 熱交換器タイプ (-)
    :type HeatExchangerType: str
    :return: 実質的な熱交換器タイプ
    :rtype: str
    """
    if HeatExchangerType is None:
        return '5'

    return HeatExchangerType
