# 付録C 大部分がガラスで構成される窓等の開口部の垂直面日射熱取得率
# ―ガラスの日射熱取得率等を用いる場合―


#
def get_etr_d_i(etr_g_i, frame_type):
    """開口部の垂直面日射熱取得率 (-) (1a, 1b, 1c)

    Args:
      etr_g_i(float): 開口部のガラスの垂直面日射熱取得率 (-)
      frame_type(str): 枠の種類

    Returns:
      float: 開口部の垂直面日射熱取得率 (-)

    """
    if frame_type == '木製建具又は樹脂製建具':
        etr_d_i = etr_g_i * 0.72
    elif frame_type == '木と金属の複合材料製建具、樹脂と金属の複合材料製建具、金属製熱遮断構造建具又は金属製建具':
        etr_d_i = etr_g_i * 0.8
    elif frame_type == '影響がない':
        etr_d_i = etr_g_i
    return etr_d_i


def get_etr_g(glass_type, attachment):
    """ガラスの垂直面日射熱取得率 (-)

    Args:
      glass_type(str): ガラスの仕様
      attachment(str): 付属部材

    Returns:
      float: ガラスの垂直面日射熱取得率 (-)

    """
    # 表1 ガラスの垂直面日射熱取得率
    table_1 = {
        '2枚以上のガラス表面にLow-E膜を使用したLow-E三層複層ガラス又はLow-E真空複層ガラス（日射取得型）': (0.54, 0.34, 0.41, 0.12),
        '2枚以上のガラス表面にLow-E膜を使用したLow-E三層複層ガラス又はLow-E真空複層ガラス（日射遮蔽型）': (0.33, 0.22, 0.26, 0.08),
        'Low-E三層複層ガラス又はLow-E真空複層ガラス（日射取得型）': (0.59, 0.37, 0.44, 0.14),
        'Low-E三層複層ガラス又はLow-E真空複層ガラス（日射遮蔽型）': (0.37, 0.25, 0.29, 0.10),
        '三層複層ガラス又は真空複層ガラス': (0.72, 0.38, 0.53, 0.18),
        'Low-E二層複層ガラス又はLow-E真空ガラス（日射取得型）': (0.64, 0.38, 0.47, 0.15),
        'Low-E二層複層ガラス又はLow-E真空ガラス（日射遮蔽型）': (0.40, 0.26, 0.31, 0.11),
        '二層複層ガラス、真空ガラス又は単板ガラス2枚を組み合わせたもの': (0.79, 0.38, 0.57, 0.17),
        '単板ガラス': (0.88, 0.38, 0.62, 0.19)
    }
    # 日射熱取得率の計算では付属部材として風除室を考慮しないため付属部材なしとして扱います
    i = {'付属部材なし': 0, '風除室': 0, '和障子': 1, '内付けの日射遮蔽部材（和障子を除く）': 2, '外付けの日射遮蔽部材': 3}[attachment]
    return table_1[glass_type][i]
