# ============================================================================
# 付録 Q 主たる居室において温水床暖房とエアコンを併用する場合の算定方法
# ============================================================================


# ============================================================================
# Q.2 温水暖房用熱源機における往き温水温度の区分及び候補
# ============================================================================

def get_Theta_SW_hs_op():
    """温水暖房用熱源機の往き温水温度の候補

    Returns:
      tuple: 温水暖房用熱源機の往き温水温度の候補
    """
    # 温水暖房用熱源機における往き温水温度の区分は区分1のみとし、
    # それに対応する往き温水温度の候補は40℃とする。
    return (40, )


# ============================================================================
# Q.3 最大暖房出力となる時の運転率
# ============================================================================

def get_r_WS_rad_max():
    """最大暖房出力となる時の運転率 [-]

    Returns:
        float: 最大暖房出力となる時の運転率 [-]
    """
    return 0.5
