# ============================================================================
# 付録A 空気集熱式太陽熱利用設備の仕様
# ============================================================================

# ============================================================================
# A.1 空気集熱式太陽熱利用設備の種類
# ============================================================================

def get_spec(type_no):
    """本算定方式が適用可能である空気集熱式太陽熱利用設備の仕様

    Args:
      type_no(int): 本算定方式が適用可能である空気集熱式太陽熱利用設備の種類

    Returns:
      list: 表A.1 本算定方式が適用可能である空気集熱式太陽熱利用設備の種類

    """
    return get_table_a_1()[type_no - 1]

def get_table_a_1():
    """表A.1 本算定方式が適用可能である空気集熱式太陽熱利用設備の種類

    Args:

    Returns:
      list: 表A.1 本算定方式が適用可能である空気集熱式太陽熱利用設備の種類

    """
    table_a_1 = [
        # 給湯部 | 自立運転用太陽光発電装置
        #       | 空気搬送ファン | 循環ポンプ
        (True, True, True),
        (True, False, True),
        (True, True, False),
        (True, False, False),
        (False, True, True),
        (False, False, True),
        (False, True, False),
        (False, False, False),
    ]
    return  table_a_1

# A.2 付加機能・装置

# A.2.1 給湯部

# A.2.2 自立運転用太陽光発電装置
