# ============================================================================
# 第三章 暖冷房負荷と外皮性能
# 第四節 日射熱取得率
# Ver.11（住宅・住戸の外皮性能の計算プログラム Ver.02.01～）
# ----------------------------------------------------------------------------
# 付録B 大部分がガラスで構成されている窓等の開口部における取得日射熱補正係数
# ============================================================================

from pyhees.section3_4_b_1 import * 

### HEESENV-66(2020/08/27)
# 簡易計算では仕様変更前の計算方法を用いるため、仕様変更前のものを残す
# 以下、仕様変更前
###
# B.1 取得日射熱補正係数

def get_f_H_i_default():
    """開口部の暖房期の取得日射熱補正係数(規定値)

    Args:

    Returns:
      float: 開口部の暖房期の取得日射熱補正係数(規定値)

    """
    return 0.51


def get_f_C_i_default():
    """開口部の冷房期の取得日射熱補正係数(規定値)

    Args:

    Returns:
      float: 開口部の冷房期の取得日射熱補正係数(規定値)

    """
    return 0.93


# B.1.1 開口部の上部に日除けが設置されている場合
import pyhees.section3_4_b_1_1 as shade

# B.1.2 開口部の上部に日除けが設置されていない場合
import pyhees.section3_4_b_1_2 as noshade
